app/controllers/edetailing_statuses_controller.rb

SELECT `edetailing_statuses`.* FROM `edetailing_statuses`
---
  def index
    @edetailing_statuses = EdetailingStatus.all

SELECT `edetailing_statuses`.* FROM `edetailing_statuses` WHERE `edetailing_statuses`.`id` = 2 LIMIT 1
---
  def edit
    @edetailing_status = EdetailingStatus.find(params[:id])

INSERT INTO `edetailing_statuses` (`country`, `created_at`, `framework`, `last_change`, `mark`, `note`, `product`, `state`, `updated_at`) VALUES ('prueba', '2013-10-29 14:59:02', 'prueaba', '2013-10-29 00:00:00', 'prueba', 'pues eso', 'prueba', 2, '2013-10-29 14:59:02')
---
  def create
    @edetailing_status = EdetailingStatus.new(edetailing_status_params)

    respond_to do |format|
      if @edetailing_status.save

UPDATE `edetailing_statuses` SET `note` = '29/10/2013 - Se han hecho no se qué.\r\n\r\n25/10/2013 - Esperando resolución dudas', `updated_at` = '2013-10-29 17:00:34' WHERE `edetailing_statuses`.`id` = 38
---
  def update
      @edetailing_status.update(edetailing_status_params)

DELETE FROM `edetailing_statuses` WHERE `edetailing_statuses`.`id` = 32
---
  def destroy
    @edetailing_status.destroy

SELECT `edetailing_statuses`.* FROM `edetailing_statuses` WHERE `edetailing_statuses`.`id` = 32 LIMIT 1
---
    def set_edetailing_status
      @edetailing_status = EdetailingStatus.find(params[:id])